Autodesk.Revit.DB.Visual.AssetPropertyList.SetValue(System.Collections.Generic.IList{Autodesk.Revit.DB.Visual.AssetProperty})
Sets collection of properties stored in this property list.
Remarks:
All the properties in the list are of the same AssetPropertyType.
The AssetPropertyType can only be Integer, Double4, Float or Double, Enumeration.
value:
An array of properties.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid value for this APropertyList property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2014